identification division.
program-id. f01-mult.
data division.
working-storage section.
linkage section.
01  num-1        pic 9(4).
01  num-2        pic 9(4).
01  result       pic 9(8).
procedure division using num-1 num-2 result.
    multiply num-1 by num-2 giving result.
end program f01-mult.
